Lockless CAS Optimization/artifact_files/benchmark_results/ordered_opt0_t16_r2_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     1321.98
    fsyncs/s:                     1321.98

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               20.66

General statistics:
    total time:                          10.0099s
    total number of events:              13238

Latency (ms):
         min:                                    5.49
         avg:                                   12.09
         max:                                   94.71
         95th percentile:                       17.95
         sum:                               160045.63

Threads fairness:
    events (avg/stddev):           827.3750/0.48
    execution time (avg/stddev):   10.0029/0.00