Lockless CAS Optimization/artifact_files/benchmark_results/ordered_opt0_t16_r3_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     1394.46
    fsyncs/s:                     1394.46

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               21.79

General statistics:
    total time:                          10.0084s
    total number of events:              13962

Latency (ms):
         min:                                    5.35
         avg:                                   11.46
         max:                                   80.25
         95th percentile:                       15.55
         sum:                               160060.71

Threads fairness:
    events (avg/stddev):           872.6250/0.60
    execution time (avg/stddev):   10.0038/0.00