Lockless CAS Optimization/artifact_files/benchmark_results/ordered_opt1_t1_r1_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     149.76
    fsyncs/s:                     149.76

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               2.34

General statistics:
    total time:                          10.0138s
    total number of events:              1500

Latency (ms):
         min:                                    3.08
         avg:                                    6.67
         max:                                  110.10
         95th percentile:                       15.00
         sum:                                10006.75

Threads fairness:
    events (avg/stddev):           1500.0000/0.00
    execution time (avg/stddev):   10.0067/0.00