Lockless CAS Optimization/artifact_files/benchmark_results/ordered_opt1_t1_r3_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     164.16
    fsyncs/s:                     164.16

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               2.56

General statistics:
    total time:                          10.0049s
    total number of events:              1643

Latency (ms):
         min:                                    3.08
         avg:                                    6.08
         max:                                   35.46
         95th percentile:                       15.00
         sum:                                 9997.00

Threads fairness:
    events (avg/stddev):           1643.0000/0.00
    execution time (avg/stddev):   9.9970/0.00