Lockless CAS Optimization/artifact_files/benchmark_results/writeback_opt0_t1_r2_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     166.50
    fsyncs/s:                     166.50

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               2.60

General statistics:
    total time:                          10.0018s
    total number of events:              1666

Latency (ms):
         min:                                    3.16
         avg:                                    6.00
         max:                                   65.37
         95th percentile:                       11.87
         sum:                                 9994.35

Threads fairness:
    events (avg/stddev):           1666.0000/0.00
    execution time (avg/stddev):   9.9944/0.00