Lockless CAS Optimization/artifact_files/benchmark_results/writeback_opt1_t8_r3_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     691.88
    fsyncs/s:                     691.88

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               10.81

General statistics:
    total time:                          10.0087s
    total number of events:              6926

Latency (ms):
         min:                                    4.96
         avg:                                   11.55
         max:                                   92.99
         95th percentile:                       17.63
         sum:                                80023.93

Threads fairness:
    events (avg/stddev):           865.7500/0.43
    execution time (avg/stddev):   10.0030/0.00